[
  {
    "name": "Samsung Galaxy S21 Ultra 5G 256GB (Black)",
    "category": "phones",
    "image": "https://cdn.shopify.com/s/files/1/0024/9803/5810/products/506525-Product-0-I-637474455736079729_300x300.jpg?v=1611809244",
    "price": 1949,
    "brand": "Samsung",
    "rating": 3.7,
    "numReviews": 32,
    "description": "Miss nothing, with Galaxy S21. When capturing your best moments, you no longer have to choose between photo and video. Galaxy S21 captures both, simultaneously, so you’ll never miss a moment. With 108MP camera and 8K video recording, capture the highest quality images and videos on a smartphone. Have the power to last with our toughest display, fastest processor and our most powerful battery yet."
  },
  {
    "name": "Apple iPhone 12 Pro Max 128GB (Pacific Blue)",
    "category": "phones",
    "image": "https://cdn.shopify.com/s/files/1/0024/9803/5810/products/481781-Product-0-I-637382622241807429_1d121773-8fb9-47e0-8898-57e9e2508c9a_300x300.jpg?v=1612750125",
    "price": 1849,
    "brand": "Apple",
    "rating": 4.6,
    "numReviews": 23,
    "description": "iPhone 12 Pro Max. 5G to download huge files on the go and stream HDR video.1 Larger 6.7-inch Super Retina XDR display.2 Ceramic Shield with four times better drop performance.3 Incredible low-light photography with the best Pro camera system on an iPhone, and 5× optical zoom range. Cinema-grade Dolby Vision video recording, editing and playback. Night mode portraits and next-level AR experiences with the LiDAR Scanner. Powerful A14 Bionic chip. And new MagSafe accessories for easy attachment and faster wireless charging.4 For infinitely spectacular possibilities."
  },
  {
    "name": "Samsung Galaxy Note20 Ultra 5G 256GB (Black)",
    "category": "phones",
    "image": "https://cdn.shopify.com/s/files/1/0024/9803/5810/products/477016-Product-0-I-637316235710196555_300x300.jpg?v=1596615740",
    "price": 1499,
    "brand": "Samsung",
    "rating": 3.9,
    "numReviews": 29,
    "description": "Forget work-life balance, Galaxy Note20 Ultra 5G gives you work-life flow. Hold the power of a computer in the palm of your hand and scribble with the S Pen that feels just like pen-to paper. Work smarter, play harder with our fastest Galaxy Note processor, smoothest display1 and superfast 5G2. It’s a gaming machine."
  },
  {
    "name": "Nokia XR20 5G 128GB (Blue)",
    "category": "phones",
    "image": "https://cdn.shopify.com/s/files/1/0024/9803/5810/products/529294-Product-0-I-637631650103986041_300x300.jpg?v=1627609939",
    "price": 879,
    "brand": "Nokia",
    "rating": 2.4,
    "numReviews": 13,
    "description": "Nokia XR20 comes with the assurance of an industry-leading 3 year manufacturer’s warranty. The quality and craftsmanship behind Nokia X series phones give us the confidence to offer a longer warranty, because we believe you should love it, trust it and keep it."
  },
  {
    "name": "Motorola G30 128GB (Phantom Black)",
    "category": "phones",
    "image": "https://cdn.shopify.com/s/files/1/0024/9803/5810/products/514845-Product-0-I-637527212947109181_300x300.jpg?v=1617084964",
    "price": 299,
    "brand": "Motorola",
    "rating": 4.2,
    "numReviews": 22,
    "description": "You want brilliance. You got it. Meet moto g30. Looking to capture stunning ultra-high resolution photos? You get an awesome 64 MP quad camera system. How about smoother-looking games and seamless scrolling? Done. The 90 Hz display refreshes faster than phones with standard displays. Maybe you want more room for photos, movies, and music? Check, check, and check. You get 128 GB of storage built right in1.Craving faster charging and longer battery life? No worries there. TurboPower™2 and a two-day battery2 keep you going. Wanna boost performance in everything you do? With moto g30 and its Qualcomm® Snapdragon™ processor, you got it."
  },
  {
    "name": "Samsung Galaxy Z Flip3 5G 256GB (Cream)",
    "category": "phones",
    "image": "https://cdn.shopify.com/s/files/1/0024/9803/5810/products/530594-Product-0-I-637668047549549503_300x300.jpg?v=1631172034",
    "price": 1599,
    "brand": "Samsung",
    "rating": 4.9,
    "numReviews": 27,
    "description": "The full screen phone that folds to fit in your pocket with revolutionary flexible glass, a camera designed to stand on its own, a dual battery that is long lasting, and the speed of 5G^. Meet the phone changing the shape of the future."
  }
]